Тестовая_база_ERP_14/src/InformationRegisters/ВидыПродукцииПоГруппамВЕТИС/ВидыПродукцииПоГруппамВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВидыПродукцииПоГруппамВЕТИС</name>
  <attributes>
    <name>ВидПродукцииНаименование</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <dimensions>
    <name>РольПользователя</name>
    <type>
      <types>EnumRef.РолиПользователейВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПриказа</name>
    <type>
      <types>EnumRef.ГруппыПродукцииУполномоченныхЛиц</types>
      <types>EnumRef.ГруппыПродукцииАттестованныхСпециалистов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПродукцииИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/ГруппыПродукцииУполномоченныхЛиц/ГруппыПродукцииУполномоченныхЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыПродукцииУполномоченныхЛиц</name>
  <enumValues>
    <name>Группа15Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа15Строка2</name>
  </enumValues>
  <enumValues>
    <name>Группа15Строка3</name>
  </enumValues>
  <enumValues>
    <name>Группа16Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа16Строка2</name>
  </enumValues>
  <enumValues>
    <name>Группа19Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа2Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа23Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа3Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа3Строка2</name>
  </enumValues>
  <enumValues>
    <name>Группа3Строка3</name>
  </enumValues>
  <enumValues>
    <name>Группа4Строка1</name>
  </enumValues>
  <enumValues>
    <name>МороженоеИДругаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Группа20Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа21Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа35Строка1</name>
  </enumValues>
  <enumValues>
    <name>Группа35Строка2</name>
  </enumValues>
  <enumValues>
    <name>Группа35Строка3</name>
  </enumValues>
  <enumValues>
    <name>Группа4Строка2</name>
  </enumValues>
  <enumValues>
    <name>Группа4Строка3</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/InformationRegisters/ВидыПродукцииПоГруппамВЕТИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Функция ВерсияПеречняСодержитГруппу35()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыПродукцииПоГруппамПриказаВЕТИС.ВидПродукцииИдентификатор КАК ВидПродукцииИдентификатор
	|ИЗ
	|	РегистрСведений.ВидыПродукцииПоГруппамВЕТИС КАК ВидыПродукцииПоГруппамПриказаВЕТИС
	|ГДЕ
	|	ВидыПродукцииПоГруппамПриказаВЕТИС.ГруппаПриказа = Значение(Перечисление.ГруппыПродукцииУполномоченныхЛиц.Группа35Строка1)";
	
	Возврат Не Запрос.Выполнить().Пустой()
	
КонецФункции // ВерсияПеречняСодержитГруппу35()

Функция ДанныеОбновленыНаНовуюВерсиюПрограммы(МетаданныеИОтбор) Экспорт

	Возврат ВерсияПеречняСодержитГруппу35();

КонецФункции // ДанныеОбновленыНаНовуюВерсиюПрограммы()

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра",             "РегистрСведений.ВидыПродукцииПоГруппамВЕТИС");
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ЭтоДвижения",                   Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыПродукцииПоГруппамПриказаВЕТИС.РольПользователя КАК РольПользователя,
	|	ВидыПродукцииПоГруппамПриказаВЕТИС.ГруппаПриказа КАК ГруппаПриказа,
	|	ВидыПродукцииПоГруппамПриказаВЕТИС.ВидПродукцииИдентификатор КАК ВидПродукцииИдентификатор
	|ИЗ
	|	РегистрСведений.ВидыПродукцииПоГруппамВЕТИС КАК ВидыПродукцииПоГруппамПриказаВЕТИС";
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры = Неопределено) Экспорт
	
	Если Параметры <> Неопределено Тогда
		УзелРегистрации = ПланыОбмена.ОбновлениеИнформационнойБазы.УзелПоОчереди(Параметры.Очередь);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ВидыПродукцииПоГруппамВЕТИС");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ВидыПродукцииПоГруппамВЕТИС.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		ДопустимыеЦелиВЕТИС.ЗаполнитьДанныеВРегистреВидыПродукцииПоГруппамПриказаВЕТИС();
		
		Если Параметры <> Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелРегистрации, Метаданные.РегистрыСведений.ВидыПродукцииПоГруппамВЕТИС);
			Параметры.ОбработкаЗавершена = Истина;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось обработать регистр ВидыПродукцииПоГруппамВЕТИС по причине: %1';
				|en = 'Не удалось обработать регистр ВидыПродукцииПоГруппамВЕТИС по причине: %1'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ВидыПродукцииПоГруппамВЕТИС,,
			ТекстСообщения);
		Параметры.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
